
#+begin_src C
  #include <stdio.h>
  #include <stdlib.h>

int cheap_hash(char *input_string) {
  int idx = 0, total = 0, multiplier = 1;

  while (input_string[idx] != '\0') {
    total += ((int)input_string[idx++] - 96) * multiplier;
    multiplier *= 26;
  }
  return total;
}

char *unhash(int hashed) {
  int idx = 0, letter_val = 0;
  char *result = malloc(10 * sizeof(char));

  if (!result)
    return NULL;

  while (hashed > 0) {
    letter_val = hashed % 26;
    letter_val = letter_val == 0 ? 26 : letter_val;
    result[idx++] = (char)(letter_val + 96);
    hashed = (hashed - letter_val) / 26;
    if (hashed == 0)
      break;
  }
  result[idx] = '\0';
  return result;
}

  int main() {
    char* input_string = "zz";
    int test = cheap_hash(input_string);
    printf("%s\n", input_string);
    printf("%d\n", test);
    printf("%s\n", unhash(test));
  }

#+end_src

#+RESULTS:
| abcd  |
| 72385 |
| abcd  |


#+begin_src C
#include <stdio.h>

int main() {
    int digit_int = 7;
    char digit_char = digit_int + '0'; // Adds the ASCII value of '0'

    printf("Character digit: %c\n", digit_char);
    return 0;
}
#+end_src

#+begin_src C
  #include <stdio.h>

  int main() {
      char digit_char = 'i'; // Adds the ASCII value of '0'
      int digit_int = 1+digit_char-'a';


      printf("Digit int: %d\n", digit_int);
      return 0;
  }
#+end_src

#+RESULTS:
: Digit int: 9



#+begin_src C
  #include <stdio.h>
  #include <string.h>

  int main() {
      char name[100] = "";
      int value=-1;

      sscanf("Vincent: is 5", "%s: is %d", name, &value);
      printf("%s: %d\n", name, value);
      return 0;
  }
#+end_src

#+RESULTS:
: Vincent:: -1



#+begin_src C
  #include <stdio.h>
  long pow100(int num) {
    long total = 1;
    while (num-- > 0)
      total *= 100;
    return total;
  }
  printf("%ld\n", pow100(2));
#+end_src

#+RESULTS:
: 10000




#+begin_src C
  #include <stdbool.h>
  #include <stdio.h>

  static int num_ingred = 3;
  static int teaspoons = 10;
  static int num_recipies = 0;
  static int recipies[1000000][3];

  void initialize(){
    for (int i=0; i < 1000000; i++)
      for (int j=0; j < num_ingred; j++)
        recipies[i][j] = -1;
  }


  void make_recipies(int remaining_spoons, int num_ingred, int idx, int *props){
      if (idx == num_ingred - 1) {
          props[idx] = remaining_spoons;
          printf("Hello\n");
          /* for (int i = 0; i < num_ingred; i++) */
          /*   recipies[num_recipies][i] = props[i]; */
          /* num_recipies++; */
          return;
      } else {
          for (int i = 0; i <= remaining_spoons; ++i) {
              props[idx] = i;
              make_recipies(remaining_spoons - i, num_ingred, idx + 1, props);
          }
      }
  }

    int main(){
        bool inc = true;
        int idx=0;
        initialize();
        int props[num_ingred];
        for (int i=0; i < num_ingred; i++)
            props[i]=0;

        make_recipies(teaspoons, num_ingred, 0, props);
        /* printf("total: %d\n", num_recipies); */
    }


#+end_src

#+RESULTS:
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |
| Hello |



